app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (date >= '2017-03-04')
---
    def index
        curr_time = DateTime.now.to_date
        @all_events = Event.all